This is a data cleanup/merge notebook.

In [1]:
import pandas as pd
import numpy as np

In [3]:
coffee_data = pd.read_csv("coffee_data.csv")
coffee_data.head()

#Clean "Year" column 
coffee_data['YEAR'] = coffee_data['YEAR'].astype(str).str[:-3].astype(object)
coffee_data.head()

,COUNTRY,YEAR,MONTH,TOTAL_PRODUCTION,DOMESTIC_CONSUMPTION,EXPORTABLE_PRODUCTION,GROSS_OPENING_STOCKS
0,Angola,1990,April,50.3450,20.0,30.3450,210.000
1,Bolivia,1990,April,122.7770,25.0,97.7770,54.000
2,Brazil,1990,April,27285.6286,8200.0,19085.6286,26926.000
3,Burundi,1990,April,487.3930,2.0,485.3930,77.000
4,Ecuador,1990,April,1503.8150,350.0,1153.8150,723.963

In [4]:
gdp_data = pd.read_csv("DP_LIVE_23012019025244104.csv")
gdp_data = gdp_data.rename(columns={"TIME":"YEAR"})
gdp_data['YEAR'] = gdp_data['YEAR'].astype(object)
gdp_data.head()

  LOCATION INDICATOR SUBJECT MEASURE FREQUENCY  YEAR      Value Flag Codes
0      AUS  GDPHRWKD     TOT     USD         A  1970  26.793218        NaN
1      AUS  GDPHRWKD     TOT     USD         A  1971  27.462937        NaN
2      AUS  GDPHRWKD     TOT     USD         A  1972  28.067364        NaN
3      AUS  GDPHRWKD     TOT     USD         A  1973  28.645413        NaN
4      AUS  GDPHRWKD     TOT     USD         A  1974  28.189555        NaN

In [5]:
cc_data = pd.read_csv("country_code_web.csv", encoding="latin")
cc_data.head()

  Country or area name ISO ALPHA-3 code
0          Afghanistan              AFG
1        Åland Islands              ALA
2              Albania              ALB
3              Algeria              DZA
4       American Samoa              ASM

In [6]:
new_cc_data = cc_data.rename(columns={"Country or area name":"COUNTRY","ISO ALPHA-3 code":"LOCATION" })
new_cc_data.head()

          COUNTRY LOCATION
0     Afghanistan      AFG
1   Åland Islands      ALA
2         Albania      ALB
3         Algeria      DZA
4  American Samoa      ASM

In [8]:
combined_coffee_country_df = pd.merge(coffee_data, new_cc_data, on="COUNTRY")
combined_coffee_country_df.head()

,COUNTRY,YEAR,MONTH,TOTAL_PRODUCTION,DOMESTIC_CONSUMPTION,EXPORTABLE_PRODUCTION,GROSS_OPENING_STOCKS,LOCATION
0,Angola,1990,April,50.345,20.0,30.345,210.0,AGO
1,Angola,1991,April,79.331,30.0,49.331,161.0,AGO
2,Angola,1992,April,77.520,35.0,42.520,136.0,AGO
3,Angola,1993,April,32.608,20.0,12.608,111.0,AGO
4,Angola,1994,April,76.802,25.0,51.802,96.0,AGO

In [11]:
all_combined = pd.merge(combined_coffee_country_df, gdp_data, on="YEAR", how="outer")
all_combined.head()

,COUNTRY,YEAR,MONTH,TOTAL_PRODUCTION,DOMESTIC_CONSUMPTION,EXPORTABLE_PRODUCTION,GROSS_OPENING_STOCKS,LOCATION_x,LOCATION_y,INDICATOR,SUBJECT,MEASURE,FREQUENCY,Value,Flag Codes
0,Angola,1990,April,50.3450,20.0,30.3450,210.000,AGO,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Bolivia,1990,April,122.7770,25.0,97.7770,54.000,BOL,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,Brazil,1990,April,27285.6286,8200.0,19085.6286,26926.000,BRA,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,Burundi,1990,April,487.3930,2.0,485.3930,77.000,BDI,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,Ecuador,1990,April,1503.8150,350.0,1153.8150,723.963,ECU,NaN,NaN,NaN,NaN,NaN,NaN,NaN